app/Models/M_User.php

SELECT *
FROM `user`
WHERE `username` = 'demo'
AND `statusUser` = 'aktif'
---
    public function get_data($username)
    {
      return $this->builder
      ->where(array('username' => $username, 'statusUser' => 'aktif'))
      ->get()->getRowArray();

UPDATE `user` SET `last_login_date` = '2023-12-01 11:38:56'
WHERE `id_user` = '1'
---
    public function edit($data, $iduser)
    {
      return $this->builder->update($data, ['id_user' => $iduser]);